# -------------
basic_start_description = Команда /start
basic_privacy_description = Политика конфидециальности


start_message = 
    <b>Привет! вот список команд:</b>
    
    /start - список команд
    /create_book - генерация книги
    /close - закончить операцию

greeting_message =
    🌟 Наш бот <b>App 5</b> в Telegram - это идеальная образовательная платформа для создания маленьких книг как для учеников школ, так и для студентов.

    💡 Наш бот максимально прост и удобен с поддержкой многих языков.

    📈 Присоединяйтесь к нашему сообществу энтузиастов-студентов и создателей прямо сейчас!

begin_button = Начать свое путешествие 🚀

# --настройки бота для пользователя
settings_message = настройки

start_cmd_description = Start Bot 🚀
create_book_cmd_description = Create Book 📚
close_cmd_description = Close 🙅‍♂️

bot_name = App 5

bot_description =
    Я создаю микро-книги на академическую тематику и загружаю их в Telegraph. 🌟

    Меня используют для обучения, чтобы быстро создать учебный материал и предоставить его аудитории в удобном формате.

bot_short_description =
    Я создаю микро-книги на академическую тематику и загружаю их в Telegraph. 🌟